---
kind: property
id: P:Autodesk.Revit.DB.Segment.Description
source: html/422c96ac-ce48-2ce6-7679-cafe655c75eb.htm
---
# Autodesk.Revit.DB.Segment.Description Property

The description of the segment.

## Syntax (C#)
```csharp
public string Description { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.